namespace App.Data.Migrations
{
    using System;
    using System.Collections.Generic;

    using Models;

    public class SeedData
    {
        private static Random rand = new Random();

        private List<Category> categories;

        private List<User> users;

        public SeedData(List<User> users)
        {
            this.users = users;

            this.Manufacturers = new List<Manufacturer>();
            this.Manufacturers.Add(new Manufacturer() { Name = "Sony" });
            this.Manufacturers.Add(new Manufacturer() { Name = "Canon" });
            this.Manufacturers.Add(new Manufacturer() { Name = "Nikon" });
            this.Manufacturers.Add(new Manufacturer() { Name = "Apple" });
            this.Manufacturers.Add(new Manufacturer() { Name = "Nokia" });
            this.Manufacturers.Add(new Manufacturer() { Name = "Samsung" });

            // Categories --------------------------------
            this.categories = new List<Category>();
            this.categories.Add(new Category()
            {
                Name = "Phones",
                Description = "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry&amp;amp;amp;#39;s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book.",
                ImagePath = "/Images/SeedImages/category/1.png",
                //Manufacturers = Manufacturers
            });
            this.categories.Add(new Category()
            {
                Name = "Cameras",
                Description = "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry&amp;amp;amp;#39;s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book.",
                ImagePath = "/Images/SeedImages/category/2.png",
                //Manufacturers = Manufacturers
            });
            this.categories.Add(new Category()
            {
                Name = "Personal computers",
                Description = "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry&amp;amp;amp;#39;s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book.",
                ImagePath = "/Images/SeedImages/category/3.png",
                //Manufacturers = Manufacturers
            });
            this.categories.Add(new Category()
            {
                Name = "Gaming consoles",
                Description = "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry&amp;amp;amp;#39;s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book.",
                ImagePath = "/Images/SeedImages/category/4.png",
                //Manufacturers = Manufacturers
            });
            this.categories.Add(new Category()
            {
                Name = "TV sets",
                Description = "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry&amp;amp;amp;#39;s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book.",
                ImagePath = "/Images/SeedImages/category/5.png",
                //Manufacturers = Manufacturers
            });

            // country -----------------------
            this.Countries = new List<Country>();
            this.Countries.Add(new Country { Name = "Bulgaria" });

            // cities -----------------------
            this.Cities = new List<City>();
            this.Cities.Add(new City() { Name = "Plovdiv" });
            this.Cities.Add(new City() { Name = "Sofia" });
            this.Cities.Add(new City() { Name = "Varna" });

            // Addresss -----------------------
            this.Addresss = new List<Address>();
            this.Addresss.Add(new Address()
            {
                Country = this.Countries[0],
                City = this.Cities[this.GetRandomNumber(0, this.Addresss.Count - 1)],
                Street = "Vasil Levski 2",
                Latitude = 42.145404,
                Longitude = 24.7480313
            });
            this.Addresss.Add(new Address()
            {
                Country = this.Countries[0],
                City = this.Cities[this.GetRandomNumber(0, this.Addresss.Count - 1)],
                Street = "Vasil Levski 2",
                Latitude = 42.145404,
                Longitude = 24.7480313
            });
            this.Addresss.Add(new Address()
            {
                Country = this.Countries[0],
                City = this.Cities[this.GetRandomNumber(0, this.Addresss.Count - 1)],
                Street = "Vasil Levski 2",
                Latitude = 42.145404,
                Longitude = 24.7480313
            });
            this.Addresss.Add(new Address()
            {
                Country = this.Countries[0],
                City = this.Cities[this.GetRandomNumber(0, this.Addresss.Count - 1)],
                Street = "Vasil Levski 2",
                Latitude = 42.145404,
                Longitude = 24.7480313
            });

            // Promotions -----------------------
            this.Promotions = new List<Promotion>();

            this.Promotions.Add(new Promotion()
            {
                Name = "First promotion",
                StartDate = DateTime.UtcNow,
                EndDate = DateTime.UtcNow.AddDays(30),
                ImagePath = "/Images/SeedImages/promo/3.jpg"
            });
            this.Promotions.Add(new Promotion()
            {
                Name = "Second promotion",
                StartDate = DateTime.UtcNow,
                EndDate = DateTime.UtcNow.AddDays(30),
                ImagePath = "/Images/SeedImages/promo/2.jpg"
            });
            this.Promotions.Add(new Promotion()
            {
                Name = "Third promotion",
                StartDate = DateTime.UtcNow,
                EndDate = DateTime.UtcNow.AddDays(30),
                ImagePath = "/Images/SeedImages/promo/3.jpg"
            });

            // Products -----------------------
            this.Products = new List<Product>();

            this.Products.Add(new Product()
            {
                Name = "Galaxy S6",
                Description = @"Мрежа: 2G GSM 850 / 900 / 1800 / 1900, 3G HSDPA 850 / 900 / 1900 / 2100, 4G LTE
Изработен с внимание и прецизност към всеки детайл SAMSUNG Galaxy S6 G920 идва по-стилен от всякога. Още с първия поглед Galaxy S6 Ви пленява с иновативния си дизайн- предния и задния панел са изработени от специални закалени Gorilla Glass 4 стъкла, а рамката с която са подсилени е направена от метал.
Насладете се на перфектни контрасти, ярки и наситени цветове, благодарение на 5-инчовия Super AMOLED дисплей.
Под този страхотен корпус се крие мощен четири-ядрен процесор, работещ с четири Cortex-A57 ядра на 1.9 GHz и четири Cortex-A53 на 1.3GHz, които са изработени по нова технология с цел да отделят по-малко топлина и да щадят повече батерията.
В допълнение на всичко това, като прибавим и 3GB оперативна памет, може да бъдете абсолютно сигурни, че гледането на филми, слушането на музика и ползването на няколко приложения едновременно ще се случва със светкавична скорост.
Уловете моментите, които означават най-много за Вас и се насладете на изключителна детайлност и реалистични цветове във всеки един кадър с усъвършенстваната 16MP камера. Сред многобройните функции са оптична стабилизация, автофокус с инфра-червена технология за точно измерване на разстоянието до образа, също така може да записва и 4K видео клипове.
Направете страхотни селфи-снимки с помощта на предната 5МР камера и ги споделете на мига с приятелите си в социалните мрежи.
Samsung използват иновативна технология за бързо зареждане, което гарантира, че батерията на Вашия телефон издържа до 4 часа и то само след 10 минутно зареждане.
Режимът Ultra Power Saving Mode удължава допълнително живота на батерията като деактивира всички ненужни приложения и програми.
На Ваше разположение са още вграден сензор за отпечатъци, система за безконтактно плащане, сензор за измерване на пулса.
Galaxy S6 G920 работи с Android 5 Lollipop, който е по-бърз и оптимизиран.
Galaxy S6 е проектиран така, че да Ви послужи във всяка една ситуация, изваждайки на преден план Вашия личен стил.",
                ShortDecription = @"Проектиран така, че да Ви послужи във всяка една ситуация, изваждайки на преден план Вашия личен стил!",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[0],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[5],
                Price = 1050,
                Quantity = 5,
                Whidth = 10,
                Heigth = 15,
                Depht = 4,
                Weight = 0.5,
                ImagePath = "/Images/SeedImages/products/Galaxy/1.png"

                // Images = new List<Image>() {
                //    new Image() { ImagePath = "/Images/SeedImages/products/Galaxy/1.png"},
                //    new Image() { ImagePath = "/Images/SeedImages/products/Galaxy/2.png" },
                //    new Image() { ImagePath = "/Images/SeedImages/products/Galaxy/3.png" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "Galaxy Edge",
                Description = @"Мрежа: 2G GSM 850 / 900 / 1800 / 1900, 3G HSDPA 850 / 900 / 1900 / 2100, 4G LTE 800 / 850 / 900 / 1700 / 1800 / 1900 / 2100 / 2600 (Bands 1, 2, 3, 4, 5, 7, 8, 20) - SM-N915FY

Samsung изненадаха много приятно своите потребители с иновативния и нестандартен N915 Galaxy Note Edge.

Гърбът на N915 е изработен от специална пластмаса, имитираща кожа.

Металната рамка, с която са подсилени предния и задния панел, допълнително придава стил на Note Edge.

Наслаждавайте се на страхотни цветове и контрасти, дори на пряка слънчева светлина, благодарение на 5.6-инчовия Super AMOLED дисплей.

Иновативация за модела е извитият екран. Допълнителната извита част, разстилаща се вместо рамка по целия десен ръб, е напълно достъпна за операционната система и всички приложения и се използва много активно.

Ето и някой удосбства, които Ви предлага извитата част на екрана: докато вашият Galaxy Note Edge е заключен, при плъзване на пръст по извитата част получавате малка лента с дата, час, времето навън както и иконки за пропуснати разговори, съобщения, имейли. Може да настроите и лентата да съдържа шорткъти към различни приложения.

Съчетанието на мощен четири-ядрен Krait 450 процесор с честота на работа 2.7 GHz и с 3GB RAM памет карат Galaxy Edge да работи безупречно, дори с по-тежки програми и приложения.

На Ваше разположение е 16 MP камера. С нея може да заснемете и най-неочакваната ситуация с отлично качество.

Предната камера на Galaxy Note 4 е 3.7МР и е разработена специално за селфи снимки, с многобройни панорами и вградени ефекти.

Galaxy Note Edge разполага и с S-Pen писалка. С нея имате възможност да водите бележки, да търсите рисунки, да изрязвате текст, картини и други.

Бъдете уникални и различни със Samsung N915 Galaxy Note Edg",
                ShortDecription = @"Докоснете се до лукса с елегантния Galaxy S6 Edge G925, бижу, което си заслужава да притежавате!",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[0],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[5],
                Price = 1099,
                Quantity = 5,
                Whidth = 10,
                Heigth = 15,
                Depht = 4,
                Weight = 0.5,
                ImagePath = "/Images/SeedImages/products/Edge/1.jpg"

                // Images = new List<Image>()
                // {
                //    new Image() { ImagePath = "/Images/SeedImages/products/Edge/1.jpg" },
                //    new Image() { ImagePath = "/Images/SeedImages/products/Edge/2.jpg" },
                //    new Image() { ImagePath = "/Images/SeedImages/products/Edge/3.jpg" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "XPERIA Z5",
                Description = @"Мрежа: 2G GSM 850 / 900 / 1800 / 1900; 3G HSDPA 850 / 900 / 1900 / 2100; 4G LTE band 1(2100), 2(1900), 3(1800), 4(1700/2100), 5(850), 7(2600), 8(900), 12(700), 17(700), 20(800), 28(700), 38(2600), 40(2300)
Революционна камера и иновационен дизайн. Запознайте се със смартфона, с който ще заснемате перфектните снимки всеки ден.
Накарайте мимолетното да трае вечно. Уловете мига с най-бързия ни автоматичен фокус. Xperia Z5 ви позволява да уловите най-страхотните възможности за снимки в живота, преди да ви подминат. Благодарение на хибридния автоматичен фокус най-добрият ни камерафон досега е майстор в бързината и точността. В комбинация с 23 мегапиксела и петкратно мощно мащабиране на изображението Xperia Z5 е способен да улови дори най-мимолетните мигове. С кристална яснота. От първия опит.
Специалният бутон за камерата, намиращ се отстрани на Z5, ви дава усещането че снимате с цифров фотоапарат, а и предотвратява размазванията.
Осветете нощта. Най-добрата технология на Sony за слаба светлина в камерафон. С Xperia Z5 няма да изгубите магията на нощта. Оборудвани със сензор за изображения на Sony от следващо поколение, можете да заснемате красиви нощни сцени в момента, в който ги видите. Без обичайните шум и замъгляване.
Усещането, което красотата създава. Xperia Z5 предоставя разлика в дизайна, която можете да почувствате. Метална рамка с прецизна гравюра. Гладка, изчистена форма. И гръб от матирано стъкло, който е нежен за очите и приятен за докосване.
Няма нищо против малко дъжд. С водоустойчивия и прахоустойчивия дизайн не ви е необходимо да планирате резервна дата в случай на дъжд Случва се да завали. Случва се и да изпуснете телефона си в умивалника или да разлеете питието си върху него. Xperia Z5 разполага с водещия водоустойчив* дизайн на Sony и рейтинг за защита IP68. Тъй като денят ви не трябва да се проваля от малко вода.
Телефонът, който ви познава. Бутонът за захранването на Xperia Z5 включва новия ни интегриран сензор за пръстови отпечатъци. Бутонът е позициониран интуитивно отстрани на телефона, така че да можете да го вземете и отключите защитено с едно движение.
Какво ще кажете, ако дните ви станат по-дълги? Правете повече с живот на батерията до два дни. Xperia Z5 ви предоставя единствен по рода си заряд на батерията до два дни** само с едно зареждане. Слушайте повече музика, говорете дни наред и прекарвайте по-дълго време навън, без да се тревожите. Ако ви е необходимо допълване, Xperia Z5 разполага с възможности за бързо зареждане, за да ви осигури заряд за цял ден само с 45 минути зареждане.
Само най-добрия звук. Благодарение на аудиото с висока честота на дискретизация и поддръжката на цифрово изолиране на шума можете да чуете музиката по начина, за който е била създадена, и да блокирате всичко останало.
По-ярки цветове. Всичко, което виждате, е по-ярко на този Full HD дисплей с технологиите на телевизорите Sony BRAVIA, вградени в него.
Играйте навсякъде. Функцията за отдалечено възпроизвеждане на PS4™ ви позволява да получите достъп до вашата PS4 конзола от смартфона си и да продължите да играете във всяка стая.
* Xperia Z5 е водоустойчиво и защитено от проникване на прах устройство, така че не се притеснявайте, ако неочаквано завали дъжд или искате да измиете замърсяване под течаща вода, но помнете: всички портове и прикрепени капаци трябва да бъдат добре затворени. Не трябва нито да потапяте устройството изцяло под вода, нито да го излагате на морска вода, солена вода, хлорирана вода или течности като напитки. Злоупотребата и неправилната употреба на устройството ще направят гаранцията невалидна. Устройството е с рейтинг за защита от проникване IP65/68.",
                ShortDecription = @"Революционна камера и иновационен дизайн. Запознайте се със смартфона, с който ще заснемате перфектните снимки всеки ден.",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[0],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[0],
                Price = 1020,
                Quantity = 5,
                Whidth = 10,
                Heigth = 15,
                Depht = 4,
                Weight = 0.5,
                ImagePath = "/Images/SeedImages/products/Xperia/1.jpg"

                // Images = new List<Image>()
                // {
                //    new Image() { ImagePath = "/Images/SeedImages/products/Xperia/1.jpg" },
                //    new Image() { ImagePath = "/Images/SeedImages/products/Xperia/2.jpg" },
                //    new Image() { ImagePath = "/Images/SeedImages/products/Xperia/2.jpg" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "iPhone 6S",
                Description = @"Преоткрийте свободата да общувате с новия iPhone 6. 
Изключително лек, с нов по-голям дисплей, нова камера и бърз процесор той ви отвежда отвъд границите на вашето въображение.
Удароустойчив дисплей с олеофобично покритие
Дисплей 4.7"" - IPS с LED подсветка; 16M цвята; 1334x750 - пиксела
Памет - 16GB; 1GB RAM
Процесор - Дву ядрен, 1.4 GHz Cyclone (ARM v8 - based);
            Apple A8 чипсет;
            Ново поколение графичен процесор -PowerVR GX6450(четири - ядрен графичен ускорител)
Операционна система iOS 8, upgradable to iOS 8.0.2
Батерия - Li - Po 1810 mAh; 250 часа в режим на готовност; 14 часа време за разговори; 50 часа слушане на музика",
                ShortDecription = @"Преоткрийте свободата да общувате с новия iPhone 6. Изключително лек, с нов по-голям дисплей, нова камера и бърз процесор той ви отвежда отвъд границите на вашето въображение.",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[0],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[3],
                Price = 1249,
                Quantity = 5,
                Whidth = 10,
                Heigth = 15,
                Depht = 4,
                Weight = 0.5,
                ImagePath = "/Images/SeedImages/products/iPhone/1.png"

                // Images = new List<Image>()
                // {
                //    new Image() { ImagePath = "/Images/SeedImages/products/iPhone/1.png" },
                //    new Image() { ImagePath = "/Images/SeedImages/products/iPhone/2.png" },
                //    new Image() { ImagePath = "/Images/SeedImages/products/iPhone/3.png" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "Microsoft Lumia 950 XL",
                Description = @"Мрежа: 3G GSM 850 / 900 / 1800 / 1900 - SIM 1 & SIM 2; 3G HSDPA 900 / 2100 - SIM 1
Ето един страхотен телефон,
                който е пригоден за многобройни и продължителни разговори.
Литиево - йонната му батерия и нейният капацитет не само ще позволят разговори в продължение на 10 часа,
                а и зареждане на батерията по всяко едно време.
Това,
                което прави Nokia 515 специален е Gorilla Glass 2 покритието,
                което представлява една допълнителна защита на телефона.
Друга екстра,
                която производителят е добавил,
                това е 3G - връзката.
Камерата е 5MP,
                с автофокус и светкавица.Специалната опция за разпознаване на лица и усмивки ще направи качеството на снимките още по - добро.
Алуминиев корпус",
                ShortDecription = @"Cтрахотен телефон, пригоден за многобройни и продължителни разговори, Gorilla Glass 2 покритие, 3G-връзка.",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[0],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[4],
                Price = 989,
                Quantity = 5,
                Whidth = 10,
                Heigth = 15,
                Depht = 4,
                Weight = 0.5,
                ImagePath = "/Images/SeedImages/products/Lumia/1.jpg"

                // Images = new List<Image>()
                // {
                //    new Image() { ImagePath = "/Images/SeedImages/products/Lumia/1.jpg" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "D5200",
                Description = @"24,1-мегапикселов CMOS сензор на изображенията с формат DX: прави красиви детайлни снимки и филми. Можете да изрязвате снимките, без да загубите нито един детайл, а отпечатаните ви снимки изглеждат великолепно в голям формат.
Дисплей с променлив ъгъл: обърнете го, наклонете го, завъртете го изследвайте креативността си с този гъвкав обръщащ се дисплей. Правете уникални снимки от всякакви ъгли, включително невероятни автопортрети от всеки ъгъл.
Вдъхновявайте се от D-Movie: записвайте видеоклипове с пълна HD и фини детайли, които'искате да споделите. Възползвайте се от безпроблемното записване (до 60i/50i) и вградения стерео микрофон.
Адаптерът за безжична връзка с мобилно устройство WU-1a: ви дава възможност да споделяте изображения директно от D5200 към смартфон или таблет с Android™ или iOS<>™* или да управлявате дистанционно фотоапарата чрез смарт устройството си.
EXPEED 3: Бързият и мощен процесор на Nikon за обработка на изображенията осигурява бърза работа, забележително ясни снимки с великолепна репродукция на цветовете и по-добър запис на филми.
Висока ISO чувствителност (100-6400, разширяема до 25 600 еквивалент): наслаждавайте се на свободата, която ви осигуряват прекрасните работни характеристики при слаба осветеност. Осигурява детайлни изображения, когато е тъмно, и ясни снимки на бързо движещи се обекти при всякаква светлина.
39-точкова АФ система: с 39 точки за фокусиране (9 от които са от кръстосан тип) за изключителна точност. Усъвършенстваното 3D проследяване на обектите, поддържа на фокус дори най-малките обекти, колкото и непредвидими да са движенията им.
2 016-пикселов RGB измерващ сензор: предоставя прецизно измерване за точни експонации и изпраща данни към системата за разпознаване на сцени, която оптимизира автоматичната експонация, автоматичното фокусиране и автоматичния баланс на бялото.
Режим с ефекти: създавайте отличаващи се снимки и филми с помощта на гама специални ефекти, включително селективен цвят и ефект миниатюра. Докато снимате, можете да видите избрания от вас ефект в реално време.
Серийно снимане със скорост 5 кадъра/сек.: заснемете действието с бързите пет кадъра за секунда и уловете бързо отминаващите моменти или изражения точно в подходящия момент.
D-Movie режими на АФ: Автоматичното фокусиране с live view (преглед в реално време) действа, докато снимате филми. Дръжте обектите ясни и на фокус чрез АФ със следене през цялото време (AF-F). Отдъхнете и оставете фотоапарата да проследява обекта ви с помощта на АФ с проследяване на обекта или АФ с приоритет на лица.
HDR (Широк динамичен диапазон): улавяйте повече подробности, когато снимате в условия на осветление със силен контраст. Идеален за неподвижни обекти; фотоапаратът прави две снимки с различни експонации при едно освобождаване на затвора и след това ги комбинира, за да създаде великолепна снимка с естествен контраст.
Активен D-Lighting: запазва детайлите както в тъмните, така и в ярко осветените участъци, когато снимате при силна светлина или в ситуации с контражур. Идеален за снимки на движещи се обекти.
16 сценични режима: направете прекрасни снимки, като просто изберете режима, който отговаря на обекта или снимачната ситуация. Сценичните режими оптимизират настройките, като скорост на затвора, ISO и диафрагмата, което е идеално, ако искате бързо да направите перфектни снимки или сте новак в цифровата огледално-рефлексна фотография.
LCD дисплей с висока разделителна способност: вижте всеки детайл от снимките и филмите си благодарение на широкият ъгъл на виждане 7,5-сантиметров (3,0-инчов) с широк ъгъл на виждане LCD дисплей с 921 000 точки, висока разделителна способност, голям ъгъл на виждане и високо ниво на контраст. Композирайте снимки или прилагайте специални ефекти за по-голяма яснота независимо от това дали снимате на закрито или навън.
Интелигентен дизайн: малкият, лек корпус и невероятната ергономичност превръщат снимането с този фотоапарат в удоволствие. Здравият захват осигурява удобство при държане. Ясните менюта и бутоните с едно докосване за често използвани функции, като D-Movie и Live View (преглед в реално време), правят работата бърза и интуитивна.
Безжично дистанционно управление: Устройствата за безжично дистанционно управление от Nikon WR-R10 и WR-T10 са опционални принадлежности, които ви позволяват да управлявате от разстояние основните функции на фотоапарата дори ако между вас и него има препятствия. Тези устройства са идеални за заснемане на автопортрети и могат да ви помогнат да предотвратите заклащането на фотоапарата по време на освобождаването на затвора.
Обективи NIKKOR: възползвайте се от предимствата на легендарните обективи NIKKOR от Nikon и използвайте максимално 24-мегапикселовата разделителна способност на фотоапарата. Правете снимки с живи цветове и впечатляващ контраст. Снимайте филми с детайли с висока рязкост или експериментирайте с кинематографични ефекти.
* Съвместимост със смарт устройства под iOS и Android™. Тази функция изисква използване на специално приложение, което може да бъде изтеглено безплатно от Google Play™ и iTunes Store®. Android, Google, Google Play, YouTube и други марки са търговски марки на Google Inc.",
                ShortDecription = @"Oткрийте нови перспективи с помощта на вдъхновяващия D5200.",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[1],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[2],
                Price = 949,
                Quantity = 5,
                Whidth = 40,
                Heigth = 25,
                Depht = 15,
                Weight = 2,
                ImagePath = "/Images/SeedImages/products/D5200/1.jpg"

                // Images = new List<Image>()
                // {
                //    new Image() { ImagePath = "/Images/SeedImages/products/D5200/1.jpg" },
                //    new Image() { ImagePath = "/Images/SeedImages/products/D5200/2.jpg" },
                //    new Image() { ImagePath = "/Images/SeedImages/products/D5200/3.jpg" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "D7200",
                Description = @"В D7200 всичко е направено перфектно. Най-доброто в този клас автоматично фокусиране, наследено от легендарните професионални фотоапарати на Nikon, осигурява прецизно улавяне на обектите надолу до -3 EV. Специалното меню за настройките на филмите и усъвършенстваните опции за аудиоконтрол предоставят на кинематографистите по-голяма универсалност. Функциите за снимане със светлинни следи и плавно заснетите филми от серия снимки през интервал разширяват творческите възможности, а обективите NIKKOR осигуряват богатство от детайли. Вградената Wi-Fi функция и поддръжката на NFC улесняват качването на впечатляващи неподвижни изображения.
Реализирайте амбициите си: Вдигнете летвата за снимането си с богати на детайли неподвижни изображения и филми. Постигнете 24,2-мегапикселови снимки с полиграфическо качество на всеки обект и ясни видеоклипове на сцени, снимани през нощта.
Професионални работни характеристики на АФ: Системата за АФ на D7200, която е най-добрата в класа си, улавя целта ви с невероятна точност. С чувствителност надолу до -3 EV получавате първокласно улавяне на обектите дори когато е тъмно.
Справяйте се превъзходно при слабо осветление: Заснемайте по-отчетливи, по-чисти и по-добре дефинирани изображения при високи стойности на ISO. С диапазон на ISO 10025 600 можете да снимате уверено при наличната светлина.
Кинематографичен видеоклип: Заснемайте лесно впечатляващи видеоклипове. С видеофункциите си, наследени от професионалните фотоапарати Nikon, и с лекото си тяло, D7200 е мечтата на тези, които снимат видеоклипове.
Споделете идеите си: Вградената Wi-Fi? функция и поддръжката на NFC (комуникация в близко поле) улесняват качването на впечатляващи снимки с помощта на смарт устройство.
Бързо непрекъснато снимане: Снимайте до 6 кадъра/сек във формат DX и до 7 кадъра/сек при 1,3-кратно изрязване. Големият буфер на фотоапарата означава, че можете да улавяте до 27 12-битови RAW изображения и до 100 JPEG с високо качество при една серия от снимки с висока скорост.
Неограничено непрекъснато снимане: Осигурете си зрелищно снимане на светлинни следи. Снимайте в непрекъснат режим на снимане със скорост на затвора 4 секунди или по-ниска и можете да запишете толкова изображения във формат JPEG, колкото позволяват картите ви и животът на батерията.
Филм снимки зад. инт.: Снимайте серии снимки през интервал с плавни преходи на експозицията. Използвайте режима със серия снимки през интервал, за да запазвате изображения като файлове с филми и да гледате бавното действие чрез бързо възпроизвеждане.
24,2-мегапикселова богата детайлност: постигнете ново ниво при качеството на изображението. Специално конструиран без оптичен нискочестотен филтър (OLPF), сензорът за изображения на D7200 с формат DX използва максимално 24,2-мегапикселовата си разделителна способност за ясно заснемане на изображения с голям динамичен диапазон, малък шум и богато преливане на цветовете.
51-точков АФ Multi-CAM 3500 II: със системата си за автоматично фокусиране, наследено от професионалните фотоапарати Nikon, D7200 предлага феноменална прецизност. Чувствителността на системата достига надолу до -3 EV (ISO 100, 20 °C/68 °F), така че можете да заснемате ясни изображения дори в тъмното. Петнадесетте сензора от кръстосан тип в центъра осигуряват първокласно улавяне на обектите. Една централна точка е съвместима с f/8, което дава възможност за повече комбинации обектив/телеконвертор.
EXPEED 4: повишава цялостната производителност на фотоапарата за постигане на изключителни резултати. Дава възможност за великолепно предаване на изображенията и на ISO характеристиките, както и за по-високи кадрови честоти при заснемане на филми.
1,3-кратно изрязване: осигурете се допълнителен телефото ефект, скорост и по-широка зона на покритие на АФ. Режимът на изрязване увеличава 1,3 пъти обхвата на обективите с формат DX и почти удвоява телефото ефекта на обективите с формат FX, като ви дава възможност да снимате със скорост до 7кадъра/сек. Този режим дава също така възможност на 51-та точки за фокусиране на системата за АФ да покрият целия кадър.
Picture Control 2.0: получете пълен контрол на рязкостта, контраста, яркостта, нюанса и наситеността при заснемане на неподвижни изображения и видеоклипове. Лесна последваща обработка с настройката Равни за максимален динамичен диапазон; постигнете отчетливи детайли с помощта на настройката Яснота. Настройките могат да бъдат регулирани визуално, докато снимате, като освен това можете да ускорите процеса на снимане, като запазите различните опции за филми и снимки в специално меню.
D-Movie с няколко зони: снимайте висококачествени видеоклипове със забележимо по-малък шум в няколко формата на кадъра. Записвайте Full HD филми с формат DX при 25p/30p или превключете на режим на 1,3-кратно изрязване за допълнителен телефото ефект и записвайте при 1080/50p/60p. Фотоапаратът предлага чист HDMI изход, а също така и едновременно записване на видеоклипове с пълна разделителна способност във фотоапарата и върху външно записващо устройство.
Свобода при заснемане на филми: съвкупността от настройки ви осигурява пълен контрол на видеоклиповете. Осигурете си плавен преход между тъмните и ярките зони чрез автоматично управление на ISO в ръчен режим. Снимайте в режим Маркирано показване, за да видите върху дисплея на фотоапарата точно къде силно осветените елементи са станали бели. Използвайте Равни от Picture Control за по-лесно градиране на цветовете при публикуването. Специалното меню за филми ви позволява да съхранявате всички настройки за филми на едно място.
Контрол с висока точност на звука: записвайте филми с желания от вас звук чрез първокласните опции на D7200 за контрол на звука. Можете да избирате звуковия диапазон (широколентов/глас) и да намалите шума от вятъра при запис с вградения микрофон. За да се осигури максимална свобода при запис на звук директно от източника, безжичният микрофон Nikon ME-W1 записва висококачествен звуков сигнал в радиус до 50 м.
Ясен визьор: предлага приблиз. 100% покритие на кадъра и изключителна видимост на открито дори в ситуации с неблагоприятен контражур. Снабден е с органичен EL елемент за ясен екран с информация с висок контраст при нисък разход на енергия.
Здрав и надежден: тялото на фотоапарата D7200 е устойчиво на прах, атмосферни условия и изпускане, тъй като е създадено, за да устоява на различни условия. Капакът от магнезиева сплав и задните капаци увеличават издръжливостта, а блокът на затвора е тестван за 150 000 цикъла на освобождаване.
Обективи NIKKOR: D7200 е съвместим с пълната гама обективи с формат DX и голям диапазон от обективи с формат FX на Nikon. С изключително високата разделителна способност обективите NIKKOR осигуряват изключителни резултати, а компактните размери на обективите с формат DX е истинско предимство, когато искате да пътувате с лек багаж или да правите телефото снимки. Снимайте в режим на 1,3-кратно изрязване и можете да увеличите телефото обхвата на обектив като AF-S DX NIKKOR 18300mm f/3.56.3G до 390 мм (еквивалентни).
Вградена светкавица: с интелигентно i-TTL управление на светкавицата и функция за команден модул, която ви дава възможност да задействате безжично и да управлявате до две групи отдалечени светкавици Nikon Speedlight от фотоапарата.
Система за креативно осветяване: използвайте D7200 заедно с гама от универсални светкавици Speedlight за творческо снимане с вградена или външна светкавица. Водещата в отрасъла система за креативно осветяване на Nikon включва бързи висококачествени светкавици, като SB-700, както и такива като SB-500, която има вградена LED лампа с висока интензивност, идеална за запис на филми.
Управление от разстояние: специалните аксесоари ви предоставят множество опции за безжично управление и за предаване на изображенията. Снимайте дистанционно с фотоапарата с помощта на смарт устройство, като използвате вградената Wi-Fi функция и специалното приложение WMU?. За допълнително управление на безжичното снимане използвайте безжичния приемопредавател WR-R10 и безжичния предавател WR-T10 или контролирайте настройките на фотоапарата с безжичното дистанционно управление WR-1. За свързване към Ethernet и безжична локална мрежа използвайте опционалния предавател на данни UT-1 заедно с безжичния предавател WT-5.
Поддръжка на NFC: прехвърляйте лесно изображения на смарт устройство, съвместимо с NFC. Трябва само да допрете D7200 до някое смарт устройство и ще можете да прехвърлите изображението, което се показва върху LCD дисплея на фотоапарата.
Енергоспестяваща конструкция: снимайте по-дълго с едно зареждане. Улавяйте до 1110 неподвижни изображения и видеоклипове с дължина до 80 минути? с едно зареждане на ултракомпактната и олекотена литиево-йонна акумулаторна батерия EN-EL15.
Носители за съхранение: двата слота за SD карти дават възможност за безпроблемно снимане. Двата слота за карти са съвместими с SDXC и UHS-I карти с голям капацитет.
Включен софтуер: продължете творческия процес и след като снимате. Специалният софтуер от Nikon предлага цялостен начин за импортиране, организиране, редактиране и споделяне на снимки или видеоклипове. Използвайте широкия диапазон от възможности за редактиране на файловете с филми, включително възможността за регулиране на параметрите на Picture Control. Възползвайте се от функциите, осигуряващи незабавно качване в социалните мрежи.
Комплект с вариообектив за обща фотография. Включва фотоапарата D7200 и обектива AF-S DX NIKKOR 18-105 мм VR. Този обектив има увеличение 5,8 пъти за ненадмината универсалност и функция за намаляване на вибрациите за ограничаване на ефектите от заклащането на фотоапарата.",
                ShortDecription = @"Крачка към съвършенството. Този пъргав D-SLR с формат DX предлага великолепни неподвижни изображения, превъзходни видеоклипове и пълна свързаност.",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[1],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[2],
                Price = 2349,
                Quantity = 5,
                Whidth = 40,
                Heigth = 25,
                Depht = 15,
                Weight = 2,
                ImagePath = "/Images/SeedImages/products/D7200/1.jpg"

                // Images = new List<Image>()
                // {
                //    new Image() { ImagePath = "/Images/SeedImages/products/D7200/1.jpg" },
                //    new Image() { ImagePath = "/Images/SeedImages/products/D7200/2.jpg" },
                //    new Image() { ImagePath = "/Images/SeedImages/products/D7200/3.jpg" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "D3200",
                Description = @"24,2 мегапикселов CMOS сензор с формат DX - Заснемете незабравими изображения с висока разделителна способност. Отпечатаните големи формати изглеждат великолепно и можете да изрязвате снимките, без да загубите нито един детайл.
Пълна 24,2-мегапикселова мощност: Специално конструиран без оптичен нискочестотен филтър (OLPF), сензорът за изображения на D3300 използва максимално 24,2-мегапикселовата си разделителна способност за ясно заснемане и на най-фините текстури и за предаване на изображенията с детайли с невероятно висока рязкост.
Начинаещ сте в цифровата огледално-рефлексна фотография? Ръководен режим - Ръководният режим използва примерни изображения и ясни инструкции стъпка по стъпка, за да ви покаже как да правите великолепни снимки и филми.
Безжичен адаптер - Откроявайте се от тълпата, снимаща със смартфони, като споделяте висококачествени снимки! Използвайте опционалния адаптер за безжична връзка с мобилно устройство WU-1а от Nikon*, за да качвате изображения от D3300 чрез смарт устройство.
Специални ефекти: с 13-те си различни ефекта, между които да избирате, D3300 улеснява добавянето на нотка майсторство към вашите снимки и филми. Преди да снимате, трябва само да изберете режим Ефекти и опцията, която искате да приложите. Пробвайте Поп, за да направите цветовете по-ярки; обхванете целия изглед с Лесна панорама; или използвайте Фотоапарат играчка, за да създадете ретро ефект.
Изключително точна 11-точкова система за АФ: Няма значение колко бързо или хаотично се движи обектът, D3300 запазва всичко на фокус. Изключително точната 11-точкова система за автоматично фокусиране със сензор от кръстосан тип в центъра бързо ще се блокира върху вашия обект и ще го запази ясен и на фокус, независимо, че не е в центъра или се движи бързо, или е напълно непредвидим.
Правете кино Full HD филми: използвайте функцията D-Movie на фотоапарата, за да правите филми, с които да се гордеете. Можете да записвате ясни Full HD (1080p) видеоклипове при всяка светлина с кадрова честота до 50p/60p с непрекъснато автоматично фокусиране, което означава, че си осигурявате плавно записване дори на действие с бързо движение плюс забележително ниво на острота и яснота
Голям LCD екран: прави снимането с D3300 толкова лесно, колкото с компактен фотоапарат или смартфон, чрез използване на големия 7,5 сантиметров (3,0-инчов) LCD монитор за заснемане на снимки и филми. Композирайте или преглеждайте снимки и прилагайте специални ефекти с осигурена яснота, благодарение на големия ъгъл на виждане и разделителната способност от 921 000 точки
Интуитивна работа: получавайте достъп до D-Movie и Преглед в реално време чрез специални бутони с едно докосване. Използвайте бутона i от задната страна на фотоапарата, за да заобиколите главното му меню и бързо да смените настройките, докато снимате. Когато снимате през визьора, можете да избирате между класически интерфейс и графичен интерфейс с анимирани настройки, така че да виждате по-лесно какво правите
Оптичен визьор: снимането през ясния, голям оптичен визьор на D3300 улеснява заснемането на фотографии в точния момент, особено при снимане на бързодвижещи се обекти от разстояние.
Малка система: с тегло само 410 г (само тялото) и снабден с малък прибиращ се китов обектив, лекият D3300 прави носенето на цифров огледално-рефлексен фотоапарат по-удобно от всякога. Въпреки компактните си размери той има голяма удобна ръкохватка, която ви улеснява да го държите стабилно, докато правите въздействащи снимки на важни моменти, независимо къде се случват те.
Обективи NIKKOR: възползвайте се от известните обективи NIKKOR от Nikon с DX формат, създадени, за да използвате максимално високия брой пиксели на D3300. Наслаждавайте се на снимки и филми с живи цветове, поразителен контраст и детайли с висока рязкост: използвайте бързите ни твърди обективи за великолепни портрети, изпробвайте работа с микрообектив за близки планове в естествени размери или с телефотообектив за ясни изображения на отдалечени обекти.",
                ShortDecription = "Mощeн, удобен за носене и невероятно лесен за работа, този 24,2MP цифров огледално-рефлексен фотоапарат предлага блестящ начин за заснемане на снимки и филми с висока разделителна способност. Ръководeн режим.",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[1],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[2],
                Price = 859,
                Quantity = 5,
                Whidth = 40,
                Heigth = 25,
                Depht = 15,
                Weight = 2,
                ImagePath = "/Images/SeedImages/products/D3200/1.jpg"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/D3200/1.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/D3200/2.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/D3200/3.jpg" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "EOS-100D",
                Description = @"DSLR фотоапарат, който няма да искате да оставите - EOS 100D е пълнофункционален и бърз DSLR фотоапарат, който също така е достатъчно малък и лек, за да може да се носи навсякъде. Идеалният фотоапарат за документиране на стила ви на живот. Заснемайте 18-мегапикселови снимки и записвайте Full HD видео навсякъде и се наслаждавайте на невероятни резултати дори при ниска осветеност: максимална ISO светлочувствителност от 12 800 (с възможност за разширяване до ISO 25 600), която ви позволява да заснемате изображения с ниско ниво на шума и пълни с атмосфера.
Лесен и приятен за използване Снимайте с помощта на яркия и бърз оптичен визьор или използвайте 1 040 000-точковия сензорен дисплей Clear View II TFT с размер 7,7 cm (3,0) и съотношение 3:2, за да управлявате фотоапарата. Работете с менютата, преглеждайте снимките и дори фокусирайте и заснемайте чрез жестове с пръсти (докосване, плъзгане и ""щипване"").
Лесно работа фантастични резултати - Технологията ""Интелигентен автоматичен режим за сцена"" на Canon анализира сцената и автоматично задава най - подходящите настройки на фотоапарата.А докато развивате фотографските си умения,
                вграденият ""Съветник за функциите"" ще ви научи как да постигнете максимални резултати с фотоапарата си.
Записвайте Full HD видео - Записвайте висококачествено видео при резолюция до Full - HD(1080p).Поемете контрол над експонацията,
                фокусирането,
                звука и още много други или използвайте режима ""Кратка видеосцена"",
                за да създадете поредица от видеосцени чрез фотоапарата.Системата ""Хибриден CMOS AF"" осигурява непрекъснато фокусиране при снимане - идеално за поддържане на фокуса на движещите се обекти.
Уловете действието - Проследявайте и снимайте бързо движещите се обекти с честота 4 fps и се възползвайте от деветте AF точки,
                за да фокусирате бързо и прецизно дори когато снимате обекти извън центъра на кадъра.
Направете следващите си творчески стъпки - Изразете креативността си чрез някой от креативните филтри на EOS 100D.Режимът ""Снимка с допълнителен ефект"" позволява заснемане едновременно на снимка с филтър и без филтър.Изберете измежду ефектите ""Зърнисто черно-бяло изображение"",
                ""Фотоапарат играчка"",
                ""Миниатюра"" и много други и прегледайте предварително ефекта на всеки филтър,
                преди да снимате.
Режим за всичко,
                което снимате - Тематичните режими за сцена автоматично избират най - подходящите настройки на фотоапарата според обекта,
                който заснемате.Изберете измежду режимите ""Портрет"",
                ""Пейзаж"",
                ""Спортни събития"",
                ""Деца"",
                ""Храна"" и много други.А когато сте готови,
                преминете към режим ""Творчески автоматичен"",
                за да получите допълнителен контрол над допълнителни характеристики(напр.разфокусиране на фона) с помощта на интуитивния интерфейс.
Добре дошли в системата EOS - Възползвайте се от широкия набор от обективи,
                аксесоари и светкавици от системата EOS.
Приложен обектив EF - S 18 - 55mm DC III",
                ShortDecription = @"Малък и бърз, 18-мегапикселов DSLR фотоапарат, който може да носите навсякъде. Разполага с оптичен визьор и интуитивно управление чрез сензорен екран.",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[1],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[1],
                Price = 719,
                Quantity = 5,
                Whidth = 40,
                Heigth = 25,
                Depht = 15,
                Weight = 2,
                ImagePath = "/Images/SeedImages/products/100d/1.jpg"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/100d/1.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/100d/2.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/100d/3.jpg" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "EOS-5D Mark III",
                Description = @"22,3-мегапикселов сензор с пълен размер на кадъра
61-точков автоматичен фокус
Снимки в серия с честота 6 кад./сек.
Светлочувствителност ISO 10025600, с възможност за разширяване до ISO 102400
Full HD видео с ръчен контрол
14-битов процесор DIGIC 5+
Защита против атмосферни влияния
1040000-точков дисплей с размер 8,11 см (3,2)
Режим HDR",
                ShortDecription = @"DSLR фотоапарат с пълен размер на кадъра, заснемащ 22-мегапикселови изображения в серия с честота 6 кад./сек. и Full-HD видео.",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[1],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[1],
                Price = 4990,
                Quantity = 5,
                Whidth = 40,
                Heigth = 25,
                Depht = 15,
                Weight = 2,
                ImagePath = "/Images/SeedImages/products/5d/1.jpg"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/5d/1.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/5d/2.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/5d/3.jpg" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "EOS-750D",
                Description = @"Всеки потребител, който през периода на промоцията при покупката на фотоапарат Canon EOS 750D е върнал стар фотоапарат или телефон с камера и в случай, че са изпълнени условията на промоцията, има право да получи отстъпка в размер на 200 лв. 
Периодът на промоцията е от 15 ноември 2015 г. до 15 януари 2016 г. Покупка, осъществена преди или след този период, не поражда правата по тази промоция.                                                   
Потребител за целите на промоцията е лице, закупило продукта за лична употреба, частна или професионална.  Всеки клиент може да закупи до два фотоапарата EOS 750D.
Обект на промоцията са само и единствено фотоапаратите    EOS 750D и всички фабрични комплекти от модела.
Всеки потребител може да регистрира покупката си и да поиска изплащането на отстъпката като :
1. Върне стар фотоапарат или телефон с камера;
2. Попълни правилно формуляр за участие в промо-цията, достъпен в търговските обекти, партньори на промоцията;
3. Приложи към формуляра за участие копие от документа за покупка (фактура и/или касова бележка).
Отстъпката се изплаща веднага - единствено в търговските обекти, партньори на промоцията, в момента на покупката.
Не се допуска изпращането на формуляр за участие и приложенията към него по елекронна поща, чрез факсимилно съобщение, по телефона или по друг подобен начин. 
Без усилие повишете качеството на снимките си до ново ниво с най-новата DSLR технология и интелигентния автоматичен режим за сцена.Снимайте с лекота невероятни детайли във всяка ситуация. Записвайте видео с качество на кинофилм с лекотата, с която заснемате снимки. Лесно се свързвайте и споделяйте своите изображения със света.
Широк избор от режими на снимане: Без усилие заснемайте изумителни изображения с помощта на най-новата DSLR технология и основните и творчески режими, които ви позволяват да поемете контрол до степента, до която желаете.
Подвижен екран за креативно кадриране: Открийте творчески ъгли на заснемане и се насладете на простия и интуитивен контрол върху фотоапарата с 3,0-инчовия (7,7 cm) подвижен сензорен LCD дисплей
Интелигентен визьор: EOS 750D разполага с интелигентен визьор, който чувствително усъвършенства процеса на снимане. Докато гледате през визьора, можете по-лесно да видите AF точката и всички активни AF зони, като същевременно следите информацията за заснемането.
Снимайте с лекота невероятни детайли във всяка ситуация: Заснемайте ярки и детайлни изображения с висока резолюция, подобрен динамичен диапазон, по-нисък шум и отличен контрол върху дълбочината на рязкост благодарение на 24,2-мегапикселовия сензор APS-C.
19 AF точки от кръстовиден тип за прецизно проследяване на обекта: Проследявайте динамичните обекти с помощта на бързата и прецизна система за автоматично фокусиране с 19 AF точки от кръстовиден тип.
Бърз процесор за заснемане на динамични сцени: Мощният процесор DIGIC 6 осигурява заснемане при пълна разделителна способност и честота 5 fps така никога няма да пропуснете важния момент.
Страхотни снимки при слаба светлина: Заснемайте незабравими снимки при слаба светлина и без светкавица благодарение на широкия диапазон на светлочувствителност от ISO 100-12800 (с възможност за разширяване до ISO 25 600)
Лесно се свързвайте и споделяйте своите изображения със света. С Wi-Fi и NFC можете бързо да се свързвате и да прехвърляте снимки и видеозаписи в съвместими смартфони, таблети, принтери или свързващата станция на Canon за лесно публикуване в социалните мрежи.
Отдалечено заснемане: Управлявайте своя фотоапарат дистанционно от смартфон или таблет с помощта на приложението Canon Camera Connect
Записвайте лесно Full HD видео с качество на кинофилм чрез DSLR контрол върху дълбочината на рязкост. Записвайте видеото си във формат MP4 за бързо споделяне онлайн и по-лесно прехвърляне в други устройства.
По-гладки преходи на фокуса: Заснемайте лесно Full HD видео с качество на кинофилм с технологията Hybrid CMOS AF III за проследяване на движение и гладко преместване на фокуса между обектите.
Разширете своята креативност с лесни режими на снимане. Позволете на фотоапарата да свърши цялата работа и с лекота да заснеме творчески изображения с помощта на режимите за сцена
Творчески режими за запис на видео: Разширете възможностите си за запис на видео с функции като ефект ""Миниатюра"" за видео и др.
Научете се как да правите страхотни снимки още днес: Запознайте се с управлението и функциите на своя EOS 750D.Уроци и подробни упражнения ви запознават с техниките за заснемане на страхотни снимки.Вижте как можете да усъвършенствате техниките си за снимане,
                като например разфокусиране на фона и композиция,
                и открийте нови начини за съхраняване и споделяне на вашите изображения.
Приложен обектив EF - S 18 - 55mm IS STM",
                ShortDecription = @"Без усилие повишете качеството на снимките си до ново ниво с най-новата DSLR технология и интелигентния автоматичен режим за сцена.",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[1],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[1],
                Price = 1379,
                Quantity = 5,
                Whidth = 40,
                Heigth = 25,
                Depht = 15,
                Weight = 2,
                ImagePath = "/Images/SeedImages/products/750d/1.jpg"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/750d/1.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/750d/2.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/750d/3.jpg" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "SAL-A58",
                Description = @"Уловете детайлите с Exmor® APS HD CMOS сензор - С чувствителност от ISO 100 до 16000 и с резолюция от 20.1MP, сензорът улавя всеки малък детайл дори при слаба светлина.
Насладете се на бърза реакция при снимане - За разлика от DSLR, технологията Translucent Mirror (полу-прозрачно огледало) означава, че няма движещо се огледало, така че можете да реагирате по-бързо, за да заснемете това, което виждате.
Композирайте уверено - Визьорът с висок контраст OLED Tru-Finder™ показва безгрешно изображенията, така както ще се показват, при всякакви настройки или корекции на експонацията,
Бъдете готови за всичко с универсалните обективи за увеличение - От широкоъгълни 18 мм до стандартни 55 мм, можете да се погрижете за всяка една снимка с леките, компактни и лесни за използване обективи за увеличение.
Прихващане на бързо движещи се обекти - Страхотен за спорт и дивата природа, автофокусната система има функция за прихващане, която проследява движещите се обекти и ги държи в ясен фокус.
Създавайте професионални снимки - Функцията Auto Object Framing (Автоматично рамкиране на обект) разпознава какво снимате и изрязва границите, за да създаде по-стегнати и професионални композиции.
Направете живота по-лесен с автофокус - Дръжте снимките и видеоклиповете винаги на фокус с 15-точковата автофокусна система с 3 кръстосани сензора и с непрекъснат автофокус.
Снимайте Full HD филми, винаги на фокус - Записвайте Full HD видеоклипове с автофокус за проследяване на обекти, за да държите дори бързо движещите се обекти на фокус.
Снимайте при висока скорост - Заснемайте бързо движещи се обекти в до 8 кадъра в секунда с непрекъснат автофокус, за да бъде всеки кадър отчетлив и ясен.
Кажете не на шума с процесора BIONZ - Мощният процесор за обработка на изображения има двойно намаляване на шума, което гарантира изображения с ниско ниво на шума и с богати нюанси
Споделяйте лесно и бързо филми онлайн - Снимайте филми в AVCHD 1080i или в MP4 формат, което е идеално за споделяне във Facebook™ и YouTube™.
Вижте приятелите си в най-добрата им светлина - Face Detection (Разпознаване на лица) разпознава до 8 лица в една сцена, оптимизира се експонацията, баланса на бялото, светкавицата и други настроики за портрети.
Заснемане на грандиозни панорами - Натиснете затвора и обходете с фотоапарата, за да заснемете широки панорамни изображения.
Добавете собствени художествени ефекти за снимки - Дайте на вашите снимки стилно усещане с до 15 креативни ефекта включително постеризация, частичен цвят, ретро, камера-играчка и много повече.
Правете красиви снимки при здрач или зазоряване - Режимът Handheld Twilight прави шест снимки в бърза последователност и използва най-добрите моменти от всеки един кадър, за да създаде идеалната снимка.
Бъдете креативни с широка гама от обективи - Открийте един свят на възможности с постоянно нарастващото семейство от взаимнозаменяеми обективи A-mount от Carl Zeiss и Sony.
Тяло SLT-A58 със стандартен вариообектив 18-55 мм",
                ShortDecription = @"Снимайте бързо, снимайте достоверно - 20.1MP Exmor® APS HD CMOS сензор, OLED Tru-Finder™, 8fps, автофокус с прихващане с SAL1855-2 обектив за увеличение. Тяло със стандартен вариообектив 18-55 мм",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[1],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[0],
                Price = 829,
                Quantity = 5,
                Whidth = 40,
                Heigth = 25,
                Depht = 15,
                Weight = 2,
                ImagePath = "/Images/SeedImages/products/a58/1.jpg"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/a58/1.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/a58/2.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/a58/2.jpg" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "ILCA-77M2",
                Description = @"Сензор Exmor® CMOS с много висока разделителна способност - Насладете се на подобрен сензор във формат APS-C с 24.3 ефективни мегапиксела. Сензорът предлага 20% по-висока чувствителност, в сравнение с предишния модел, за безупречни статични изображения с ниско ниво на шум и Full HD видео.
Процесор BIONZ X™ -Подобрената система за обработка на изображения се справя с огромно количество данни от сензора,
                за да позволи високоскоростно заснемане на страхотни снимки с нисък шум.
Патентована технология Translucent Mirror - Уникалният дизайн на Sony заменя движещото се огледало на DSLR с фиксирано прозрачно огледало,
                което дава възможност за изключително бързо заснемане с непрекъснато използване на точно откриване на фазата на автофокуса.
79 - точкова система за установяване на фазата на автофокуса - Ново разработена система на автофокус с 15 напречни сензора за точно,
                непрекъснато автоматично фокусиране ефективно с визьор или изглед на живо на LCD екран.
12fps с проследяване на автофокуса - Заснемайте бързодвижещо се действие с изключително бързо проследяване,
                с до12fps(прибл.максимална скорост при режим на постоянно автофокусиране).Снимайте 60 кадъра на серия,
                когато качеството е зададено на FINE,
                а размерът на изображението на L.
Бърз автофокус за Full HD клип - Снимайте 1920x1080 клипове с постоянно проследяващ подвижни обекти автофокус: сега с 60p / 24p прогресивно заснемане за кинематографски резултати.
Креативни Full HD movie функции - Насладете се на рязко,
                точно автофокусиране с постоянен автофокус; Режимите на експонация PASM предлагат тотален творчески контрол.
Управление на обхвата на автофокуса - Заключва автофокусирането към специфичен диапазон на разстояние от фотоапарата за остри резултати дори, ако целта е закрита за момент от друг преминаващ обект.
Широка гама на чувствителност от ISO 100 - 25 600 - Високата максимална чувствителност позволява естествени снимки с нисък шум, дори и при слаба осветеност: разширителният режим удължава чувствителността до ISO 50.
3 - посочен накланящ се LCD екран -Свободно регулируем LCD екран(1, 228k точки) с технология WhiteMagic за ясен преглед, дори под директна слънчева светлина.
Информационен екран с висока резолюция - Изберете между между опциите за показване графично показване, показване на цялата инфо., без информация.на дисплей, хистограма или цифров нивелир.
XGA OLED TruFinder™ -Прецизен електронен визьор с висок контраст и 100 % покритие на кадъра за точно кадриране, фокусиране и преглед на снимките.
Clear Image Zoom - Цифрово приближава централната част на изображението до 2 пъти с почти незабележима деградация, като почти удвоява вашия диапазон на мащабиране.
Разпознаване на лица с регистрация на лица - Разпознава се до 8 лица в сцена, оптимизира се експонацията, баланса на бялото, светкавицата и други настройки за красиви портрети.
Разширена гъвкава точка - Ако активната точка на автофокуса започне да губи следите на обекта, една от 8 заобикалящи точки на автофокуса незабавно се активира за непрекъснато, точно проследяване на вашите движещи се обекти.
Режими за подобрена зона на автофокусиране -Фиксиращ автофокус, който оптимизира размера на целевия кадър и гарантира използването на оптималната автофокусна точка, вече е на разположение като режим на зоната на фокусиране. Можете да използвате първоначалната автофокусна точка за проследяване от режима на зоната на автофокусиране Широк, Зона, Център, Гъвкава точка или Разширена гъвкава точка.
Pегулиране на проследяването в 5 стъпки - Проследяването на автофокуса може да се регулира в 5 стъпки, с ниски настройки, даващи приоритет на стабилността и високи настройки, даващи приоритет на скоростта (идеално при заснемане на обекти на различни разстояния, например). При заснемане на филми са налични три настройки.
Eye AF -Заснема лица в рязък фокус дори, когато вашият обект е частично обърнат от фотоапарата с малка дълбочина на полето.
Водещи технологии за изображения -Технологията за възпроизвеждане на детайли намалява подчертаните контури за произвеждане на по - реалистични изображения и по - фини детайли.Технологията за намаляване на дифракцията коригира замъглените детайли за постигане на по-фини детайли дори при малка настройки на блендата(голям F номер).
 Шумопотискане специфично за дадена зона -Заедно с технологията за възпроизвеждане на детайли, ефективно потиска шума за по-чисти и по-фино настроени изображения дори при високи настройки на чувствителност.
Увеличител на фокуса и функция за пик на фокуса - Увеличете вашето изображение или филм във визьора с висока резолюция за ръчна фина настройка на фокуса или използвайте пик на фокуса, за да оцветите зоните с най - остър фокус на вашето изображение за по-бързо потвърждение.
  Подобрено вградено стабилизиране на изображението - Ефективно стабилизиране на изображенията за всички съвместими обективи, в цялата гама на фокусното разстояние. Помага за стабилизиране на изображението във визьора, докато бутона на затвора е натиснат наполовина.
  Конфигурируеми бутони за функции -Задаване на често използвани функции към конфигурируемите бутони по ваш избор. Лесно задаване на 11 бутона за активиране на всяка една от 53 функции за по - бърза, по - интуитивна работа.
     Настройки на регулируем визьор -За да компенсирате за вида и количеството светлина във вашето обкръжение, регулирайте цветната температура и яркостта във визьора в 5 прости стъпки.",
                ShortDecription = @"Когато се случи изключителното, уловете го с ускорения α77 II С байонет А. С поразителните 79 AF точки, непрекъснато заснемане с 12 кад./сек. и 24,3 MP сензор Exmor® CMOS всеки момент е увековечен",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[1],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[0],
                Price = 1899,
                Quantity = 5,
                Whidth = 40,
                Heigth = 25,
                Depht = 15,
                Weight = 2,
                ImagePath = "/Images/SeedImages/products/ilca77/1.jpg"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/ilca77/1.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/ilca77/2.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/ilca77/3.jpg" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "KDL-48W705",
                Description = @"Придайте реална стойност на гледането със сензационно Full HD качество на картината и фин външен вид. Наслаждавайте се на по-интелигентно телевизионно изживяване с плавен, интуитивен достъп до вълнуващ свят от приложения, игри, филми, интернет видео и още.
Открийте вълнуващ свят от изключителна яснота. Разликата е ясна, каквото и да гледате.
Наслаждавайте се на филми, телевизионни предавания, игри и още с наситено детайлно Full HD качество.
Наслада от изгледа с бързи кадри с Motionflow XR 200Hz.
X-Reality PRO Всеки отделен пиксел е красиво мащабиран от мощната технология за обработка на картината от Sony. Отделните части от всяка сцена се анализират и съпоставят със специална база данни с изображения. Намаляването на шума от X-RealityTM PRO елиминира различните видове шум в аналоговите и цифровите телевизионни сигнали, DVD и Blu-ray Disc™, както дори в цифровите статични снимки.
Photo Share 
Наслаждавайте се на снимки от устройствата си с Android или iOS®1 на големия екран. Грабнете любимите си от телевизора, докато приятелите ви споделят специални спомени използвайки до 10 устройства.
USB HDD запис 
Превърнете телевизора си в цифров рекордер за видео. Съхранявайте любимите си предавания на външен USB твърд диск, за да им се радвате, когато пожелаете.
S-Force Front обработва аудио сигналите за създаване на завладяващо слушателско изживяване. Директната многоканална обработка гарантира реалистично ясен 360 ? съраунд звук.
Clear Phase настройва фино честотната характеристика на високоговорителите на телевизора за по-плавно, по-балансирано възпроизвеждане на всички честоти ниски, средни и високи.",
                ShortDecription = @"Придайте реална стойност на гледането със сензационно Full HD качество на картината и фин външен вид. Наслаждавайте се на по-интелигентно телевизионно изживяване с плавен, интуитивен достъп до вълнуващ свят от приложения, игри, филми, интернет видео и още.",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[4],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[0],
                Price = 1349,
                Quantity = 5,
                Whidth = 140,
                Heigth = 80,
                Depht = 35,
                Weight = 20,
                ImagePath = "/Images/SeedImages/products/48W705/1.png"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/48W705/1.png" },
                //    new Image { ImagePath = "/Images/SeedImages/products/48W705/2.png" },
                //    new Image { ImagePath = "/Images/SeedImages/products/48W705/3.png" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "KDL-43W809",
                Description = @"Поразителен детайл от всичко, което гледате Всеки отделен пиксел е красиво мащабиран от мощната технология за обработка на картината от Sony. Отделните части от всяка сцена се анализират и съпоставят със специална база данни с изображения. Намаляването на шума от X-Reality PRO елиминира различните видове шум в аналоговите и цифровите телевизионни сигнали, DVD и Blu-ray Disc™, както дори в цифровите статични снимки.
Вижте колко добре може да изглежда телевизорът 
С усъвършенствани технологии, благодарение на които всичко, което гледате, е по-рязко, плавно и реалистично, разликата при BRAVIA® е осезаема.
По-гладко, естествено движение 
Независимо какво гледате, ще се наслаждавате на гладък като коприна изглед на екрана при бързите действия с технологията Motionflow XR.
Свързване с NFC 
Отразявайте безжично мобилното си устройство Xperia™ на своя BRAVIA® с NFC One-touch.
Показвайте снимки и видео от смартфон 
Снимките и видеоклиповете от смартфона ви могат да се показват с Full HD качество благодарение на свързаността с MHL.

Обогатете гледането с TV SideView Намирайте, записвайте и говорете за любимите си телевизионни предавания с помощта на TV SideView. Това интелигентно приложение ви позволява да управлявате телевизора си и да проверявате програмата с помощта на смартфона си.
USB HDD запис 
Превърнете телевизора си в цифров рекордер за видео. Съхранявайте любимите си предавания на външен USB твърд диск, за да им се радвате, когато пожелаете.
Направен за слушане
Направете слушането също толкова реалистично, колкото и гледането. ClearAudio+ настройва фино звука от телевизора за завладяващо, емоционално обогатяващо изживяване, което сякаш ви обгръща. Чуйте музиката, диалозите и съраунд ефектите с по-голяма яснота и разделение, независимо какво гледате.
Наслаждавайте се на повече детайли във всичко, което слушате. DSEE е комбинация от нашите аудио технологии, които работят съвместно за постигане на последователно ясен, богат звук.
S-Force съруанд звук отпред обработва аудио сигналите за създаване на завладяващо слушателско изживяване. Директната многоканална обработка гарантира реалистично ясен, мощен 360 ? съраунд звук.
Clear Phase настройва фино честотната характеристика на високоговорителите на телевизора за по-плавно, по-балансирано възпроизвеждане на всички честоти ниски, средни и високи.",
                ShortDecription = @"Поразителен детайл от всичко, което гледате Всеки отделен пиксел е красиво мащабиран от мощната технология за обработка на картината от Sony. Отделните части от всяка сцена се анализират и съпоставят със специална база данни с изображения. Намаляването на шума от X-Reality PRO елиминира различните видове шум в аналоговите и цифровите телевизионни сигнали, DVD и Blu-ray Disc™, както дори в цифровите статични снимки.",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[4],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[0],
                Price = 1399,
                Quantity = 5,
                Whidth = 140,
                Heigth = 80,
                Depht = 35,
                Weight = 20,
                ImagePath = "/Images/SeedImages/products/43W809/1.png"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/43W809/1.png" },
                //    new Image { ImagePath = "/Images/SeedImages/products/43W809/2.png" },
                //    new Image { ImagePath = "/Images/SeedImages/products/43W809/2.png" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "KD-49X8309C",
                Description = @"BRAVIA® се обединява с Android TV™ 
Вашият smart TV вече е по-интелигентен. Замислете се за изживяванията, които обичате на смартфона или таблета си. Сега им се радвайте в по-голям размер и по по-добър начин от всякога на BRAVIA®
Каквото и да гледате, гледайте го с истински 4K качество 
Какъвто и да е източникът, всеки пиксел се мащабира красиво от най-мощната ни 4K технология за обработка на картината. Сцените се анализират и съпоставят със специална база данни за изображения за превъзходно реалистични детайли, независимо какво гледате.
Наслаждавайте се на повече яснота, цвят и контраст с новия 4K Processor X1™ 
Мощният 4K Processor X1 придава поразително качество на картината на всичко. Всеки източник се анализира и мащабира до най-добрата 4K резолюция, от телевизионни предавания, Blu-ray Disc™ и DVD до 4K интернет видео. Ще се наслаждавате на невероятни 4K изображения с по-голяма яснота, реалистични цветове и искрящ контраст.
Направен за слушане 
Направете слушането също толкова реалистично, колкото и гледането. ClearAudio+ настройва фино звука от телевизора за завладяващо, емоционално обогатяващо изживяване, което сякаш ви обгръща. Чуйте музиката, диалозите и съраунд ефектите с по-голяма яснота и разделение, независимо какво гледате.
Наслаждавайте се на повече детайли във всичко, което слушате. 
DSEE е комбинация от нашите аудио технологии, които работят съвместно за постигане на последователно ясен, богат звук.
S-Force съруанд звук отпред обработва аудио сигналите за създаване на завладяващо слушателско изживяване. 
Директната многоканална обработка гарантира реалистично ясен, мощен 360 ? съраунд звук.
Clear Phase 
Настройва фино честотната характеристика на високоговорителите на телевизора за по-плавно, по-балансирано възпроизвеждане на всички честоти ниски, средни и високи.
",
                ShortDecription = @"BRAVIA® се обединява с Android TV™ 
Вашият smart TV вече е по - интелигентен.Замислете се за изживяванията,
                които обичате на смартфона или таблета си.Сега им се радвайте в по - голям размер и по по - добър начин от всякога на BRAVIA®",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[4],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[0],
                Price = 1250,
                Quantity = 5,
                Whidth = 140,
                Heigth = 80,
                Depht = 35,
                Weight = 20,
                ImagePath = "/Images/SeedImages/products/49X8309C/1.png"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/49X8309C/1.png" },
                //    new Image { ImagePath = "/Images/SeedImages/products/49X8309C/2.png" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "KD-43X8307C",
                Description = @"BRAVIA® се обединява с Android TV™ 
Вашият smart TV вече е по-интелигентен. Замислете се за изживяванията, които обичате на смартфона или таблета си. Сега им се радвайте в по-голям размер и по по-добър начин от всякога на BRAVIA®
Каквото и да гледате, гледайте го с истински 4K качество 
Какъвто и да е източникът, всеки пиксел се мащабира красиво от най-мощната ни 4K технология за обработка на картината. Сцените се анализират и съпоставят със специална база данни за изображения за превъзходно реалистични детайли, независимо какво гледате.
Наслаждавайте се на повече яснота, цвят и контраст с новия 4K Processor X1™ 
Мощният 4K Processor X1 придава поразително качество на картината на всичко. Всеки източник се анализира и мащабира до най-добрата 4K резолюция, от телевизионни предавания, Blu-ray Disc™ и DVD до 4K интернет видео. Ще се наслаждавате на невероятни 4K изображения с по-голяма яснота, реалистични цветове и искрящ контраст.
Направен за слушане 
Направете слушането също толкова реалистично, колкото и гледането. ClearAudio+ настройва фино звука от телевизора за завладяващо, емоционално обогатяващо изживяване, което сякаш ви обгръща. Чуйте музиката, диалозите и съраунд ефектите с по-голяма яснота и разделение, независимо какво гледате.
Наслаждавайте се на повече детайли във всичко, което слушате. 
DSEE е комбинация от нашите аудио технологии, които работят съвместно за постигане на последователно ясен, богат звук.
S-Force съруанд звук отпред обработва аудио сигналите за създаване на завладяващо слушателско изживяване. 
Директната многоканална обработка гарантира реалистично ясен, мощен 360 ? съраунд звук.
Clear Phase 
Настройва фино честотната характеристика на високоговорителите на телевизора за по-плавно, по-балансирано възпроизвеждане на всички честоти ниски, средни и високи.
",
                ShortDecription = @"BRAVIA® се обединява с Android TV™ 
Вашият smart TV вече е по-интелигентен. Замислете се за изживяванията, които обичате на смартфона или таблета си. Сега им се радвайте в по-голям размер и по по-добър начин от всякога на BRAVIA®",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[4],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[0],
                Price = 1669,
                Quantity = 5,
                Whidth = 140,
                Heigth = 80,
                Depht = 35,
                Weight = 20,
                ImagePath = "/Images/SeedImages/products/43X8307C/1.png"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/43X8307C/1.png" },
                //    new Image { ImagePath = "/Images/SeedImages/products/43X8307C/2.png" },
                //    new Image { ImagePath = "/Images/SeedImages/products/43X8307C/3.png" },
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "KD-55S8005C",
                Description = @"Истинско откритие 
Серия S80C е една несравнима зрителна наслада, представяща поразително, енигматично зрително изживяване трябва го видите с очите си, за да повярвате.
Идеалната извивка 
Извитият екран от серията S80C притежава нежна и естествена извивка, която представя идеална комбинация между потапяне и комфорт.
Насладете се на повече яснота, цвят и контраст с новия 4K
Processor X1™ Мощният 4K Processor X1 придава поразително качество на картината. Източниците се анализират и мащабират до най-добрата 4K резолюция, от телевизионни предавания, Blu-ray Disc™ и DVD до 4K интернет видео. Ще се наслаждавате на невероятни 4K изображения с поразителна яснота, по-реалистични цветове и искрящ контраст.
Яснота 
Прецизната система за усъвършенстване на детайлите премахва шума и подсилва детайлите във всичко, което гледате, независимо от източника, за по-рязка и по-ясна картина.
Цвят 
Прецизното картографиране на цветовете независимо анализира всяка сцена и пиксел, за да приложи динамично идеалните оттенъци и тонове за богати, естествени цветове.
Контраст 
Динамичното подобряване на контраста прави светлите части на екрана по-светли, а тъмните части по-истински, дълбоко черни.
Каквото и да гледате, гледайте го с истински 4K качество
Какъвто и да е източникът, всеки пиксел се мащабира красиво от най-мощната ни 4K технология за обработка на картината. Сцените се анализират и съпоставят със специална база данни за изображения за превъзходно реалистични детайли, независимо какво гледате.
Цял свят от спиращи дъха естествени цветове 
BRAVIA® ви дава дори повече реалистични цветове вече подобрени още от мощния 4K Processor X1 и прецизната му технология за цветно картографиране. Предизвикайте цялата емоция във всяка сцена с богати, наситени червени, зелени и сини тонове. Също така ще се наслаждавате на най-богатата цветова гама, благодарение на предлагания само от Sony дисплей TRILUMINOS.
Направен за слушане 
Направете слушането също толкова реалистично, колкото и гледането. ClearAudio+ настройва фино звука от телевизора за завладяващо, емоционално обогатяващо изживяване, което сякаш ви обгръща. Чуйте музиката, диалозите и съраунд ефектите с по-голяма яснота и разделение, независимо какво гледате.
Наслаждавайте се на повече детайли във всичко, което слушате. 
DSEE е комбинация от нашите аудио технологии, които работят съвместно за постигане на последователно ясен, богат звук.
S-Force съруанд звук отпред обработва аудио сигналите за създаване на завладяващо слушателско изживяване. Директната многоканална обработка гарантира реалистично ясен, мощен 360 ? съраунд звук.
Clear Phase настройва фино честотната характеристика на високоговорителите на телевизора за по-плавно, по-балансирано възпроизвеждане на всички честоти ниски, средни и високи.",
                ShortDecription = @"Истинско откритие 
Серия S80C е една несравнима зрителна наслада,
                представяща поразително,
                енигматично зрително изживяване трябва го видите с очите си,
                за да повярвате.",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[4],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[0],
                Price = 2889,
                Quantity = 5,
                Whidth = 140,
                Heigth = 80,
                Depht = 35,
                Weight = 20,
                ImagePath = "/Images/SeedImages/products/55S8005C/1.png"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/55S8005C/1.png" },
                //    new Image { ImagePath = "/Images/SeedImages/products/55S8005C/2.png" },
                //    new Image { ImagePath = "/Images/SeedImages/products/55S8005C/3.png" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "KDL-50W809C",
                Description = @"Поразителен детайл от всичко, което гледате 
Всеки отделен пиксел е красиво мащабиран от мощната технология за обработка на картината от Sony. Отделните части от всяка сцена се анализират и съпоставят със специална база данни с изображения. Намаляването на шума от X-Reality PRO елиминира различните видове шум в аналоговите и цифровите телевизионни сигнали, DVD и Blu-ray Disc™, както дори в цифровите статични снимки.
Вижте колко добре може да изглежда телевизорът 
С усъвършенствани технологии, благодарение на които всичко, което гледате, е по-рязко, плавно и реалистично, разликата при BRAVIA® е осезаема.
По-гладко, естествено движение 
Независимо какво гледате, ще се наслаждавате на гладък като коприна изглед на екрана при бързите действия с технологията Motionflow XR.
Свързване с NFC 
Отразявайте безжично мобилното си устройство Xperia™ на своя BRAVIA® с NFC One-touch.
Показвайте снимки и видео от смартфон 
Снимките и видеоклиповете от смартфона ви могат да се показват с Full HD качество благодарение на свързаността с MHL.
Обогатете гледането с TV SideView 
Намирайте, записвайте и говорете за любимите си телевизионни предавания с помощта на TV SideView. Това интелигентно приложение ви позволява да управлявате телевизора си и да проверявате програмата с помощта на смартфона си.
USB HDD запис 
Превърнете телевизора си в цифров рекордер за видео. Съхранявайте любимите си предавания на външен USB твърд диск, за да им се радвате, когато пожелаете.
Направен за слушане 
Направете слушането също толкова реалистично, колкото и гледането. ClearAudio+ настройва фино звука от телевизора за завладяващо, емоционално обогатяващо изживяване, което сякаш ви обгръща. Чуйте музиката, диалозите и съраунд ефектите с по-голяма яснота и разделение, независимо какво гледате.
Наслаждавайте се на повече детайли във всичко, което слушате. DSEE е комбинация от нашите аудио технологии, които работят съвместно за постигане на последователно ясен, богат звук.
S-Force съруанд звук отпред обработва аудио сигналите за създаване на завладяващо слушателско изживяване. Директната многоканална обработка гарантира реалистично ясен, мощен 360 ? съраунд звук.
Clear Phase настройва фино честотната характеристика на високоговорителите на телевизора за по-плавно, по-балансирано възпроизвеждане на всички честоти ниски, средни и високи.",
                ShortDecription = @"Поразителен детайл от всичко, което гледате 
Всеки отделен пиксел е красиво мащабиран от мощната технология за обработка на картината от Sony. Отделните части от всяка сцена се анализират и съпоставят със специална база данни с изображения. Намаляването на шума от X-Reality PRO елиминира различните видове шум в аналоговите и цифровите телевизионни сигнали, DVD и Blu-ray Disc™, както дори в цифровите статични снимки.",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[4],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[0],
                Price = 1599,
                Quantity = 5,
                Whidth = 140,
                Heigth = 80,
                Depht = 35,
                Weight = 20,
                ImagePath = "/Images/SeedImages/products/50W809C/1.png"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/50W809C/1.png" },
                //    new Image { ImagePath = "/Images/SeedImages/products/50W809C/2.png" },
                //    new Image { ImagePath = "/Images/SeedImages/products/50W809C/3.png" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "KD-49X8005C",
                Description = @"BRAVIA® се обединява с Android TV™ Вашият smart TV вече е по-интелигентен. Замислете се за изживяванията, които обичате на смартфона или таблета си. Сега им се радвайте в по-голям размер и по по-добър начин от всякога на BRAVIA®
Каквото и да гледате, гледайте го с истински 4K качество Какъвто и да е източникът, всеки пиксел се мащабира красиво от най-мощната ни 4K технология за обработка на картината. Сцените се анализират и съпоставят със специална база данни за изображения за превъзходно реалистични детайли, независимо какво гледате.
Наслаждавайте се на повече яснота, цвят и контраст с новия 4K Processor X1™ Мощният 4K Processor X1 придава поразително качество на картината на всичко. Всеки източник се анализира и мащабира до най-добрата 4K резолюция, от телевизионни предавания, Blu-ray Disc™ и DVD до 4K интернет видео. Ще се наслаждавате на невероятни 4K изображения с по-голяма яснота, реалистични цветове и искрящ контраст.
Направен за слушане 
Направете слушането също толкова реалистично, колкото и гледането. ClearAudio+ настройва фино звука от телевизора за завладяващо, емоционално обогатяващо изживяване, което сякаш ви обгръща. Чуйте музиката, диалозите и съраунд ефектите с по-голяма яснота и разделение, независимо какво гледате.
Наслаждавайте се на повече детайли във всичко, което слушате. DSEE е комбинация от нашите аудио технологии, които работят съвместно за постигане на последователно ясен, богат звук.
S-Force съруанд звук отпред обработва аудио сигналите за създаване на завладяващо слушателско изживяване. Директната многоканална обработка гарантира реалистично ясен, мощен 360 ? съраунд звук.
Clear Phase настройва фино честотната характеристика на високоговорителите на телевизора за по-плавно, по-балансирано възпроизвеждане на всички честоти ниски, средни и високи.",
                ShortDecription = @"BRAVIA® се обединява с Android TV™ Вашият smart TV вече е по-интелигентен. Замислете се за изживяванията, които обичате на смартфона или таблета си. Сега им се радвайте в по-голям размер и по по-добър начин от всякога на BRAVIA®",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[4],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[0],
                Price = 1569,
                Quantity = 5,
                Whidth = 140,
                Heigth = 80,
                Depht = 35,
                Weight = 20,
                ImagePath = "/Images/SeedImages/products/49X8005C/1.png"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/49X8005C/1.png" },
                //    new Image { ImagePath = "/Images/SeedImages/products/49X8005C/2.png" },
                //    new Image { ImagePath = "/Images/SeedImages/products/49X8005C/3.png" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "Playstation 4",
                Description = @"С този пакет получавате конзола PlayStation 4 1TB, контролер, слушалка с микрофон и играта Call of Duty: Black Ops III
Call of Duty: Black Ops III
Добре дошъл в Call of Duty: Black Ops III ! В мрачното и злокобно бъдеще се ражда нова порода Black Ops войници. Те ще прекрачат отвъд линията, която разделя човечността и технологията, за да поставят под въпрос моралните ни устои.
Влез в ролята на подобрен технологично войник от бъдещето в най - дълго правената COD игра. На 6 ноември ще станат три години, посветени от Treyarch.
Кампанията предоставя възможност за кооперативен режим - до 4 играчи. Можеш да превключваш между нивата, за да споделиш изживяването с приятели.
С подобрените войници идват и нови умения за първи път в историята на COD можеш да тичаш по стените това е част от новата система за движения, както и плуване и битки под водата.
Нивата в кооперативен режим са по- големи и разчупени, като включват адекватно реагиращ изкуствен интелект.
Персонажите от кампанията могат да бъдат избирани предварително, уменията им - подобрявани чрез системата за прогрес.
Specialist' персонажи 9 различни войника, които се развиват самостоятелно. Те притежават уникални оръжия и умения за своя клас, които могат да бъдат подбирани в началото, според нуждите на отбора.
Gunsmith ново умение, което ти позволява да се екипираш с допълнителна оптика и други пособия, а ако си достатъчно креативен, можеш и да създадеш свой камуфлаж и емблеми.
Зомбитата се завръщат! нов режим, различен от кампанията на Call of Duty: Black Ops III, със своя история и самостоятелни нива на прогрес.
Sony PlayStation 4 Ultimate Player 1TB
Освободи се от всички ограничения с ултимативния PlayStation 4, създаден от Sony специално за най-запалените геймъри! Sony PlayStation 4 Ultimate Player 1TB Edition е спираща дъха гейминг система, която ще увеличи възможностите на най-успешната конзола от ново поколение в името на едно уникално игрово преживяване.
Ориентирана към геймърите и вдъхновена от разработчиците,Sony PlayStation 4 Ultimate Player 1TB Editionе върхова точка в игралните технологии, а огромното дисково пространство те освобождава от нуждата да триеш игрите, които не играеш в момента и след това да ги инсталираш или сваляш отново, когато решиш да се върнеш към тях!
Контролерът DUALSHOCK 4 съчетава изключително чувствителен six-axis сензор, както и тъч пад, намиращ се в горната част на геймпада. По този начин геймърите получават съвсем нови начини да играят и да взаимодействат с игрите.
Споделянето заема централна роля в PS4 преживяването. За първи път конзола позволява на играчите непрекъснато да качват геймплей видео или да снимат моментите на триумф с натискането на едно единствено копче. Бутонът Share на твоя контролер ти позволява да преглеждаш последните няколко минути от геймплея, след което да се върнеш в играта. PS4 улеснява геймърите в споделянето на снимки и клипове с приятели в социалните мрежи.
Направи игрите по-социални като демонстрираш на своите приятелите ин-гейм преживяванията си в реално време посредством интернет услугите, в това число и Ustream. С предаването на геймплея, приятелите ти ще имат възможност да коментират излъчвания материал и дори да ти предложат да се присъединят към играта ти по нови и вълнуващи начини. Ще можеш да свържеш профилите си във Facebook и PSN Network, за да споделяш съдържание още по-лесно!
Playstation 4 се интегрира напълно с устройства като Playstation Vita, смартфони и таблети, за да могат геймърите да се наслаждават на любимото си съдържание по всяко време и навсякъде. Second Screen елементът позволява играта от разстояние чрез PS Vita, за да се наслаждаваш на PS4, докато си в движение! Ще имаш възможност безпроблемно да играеш PS4 заглавия на екрана на своята PS Vita посредством Wi-Fi мрежите. Добавено е и Playstation приложение, за да можеш да трансформираш своя iPhone, iPad или Android смартфони и таблети във вторичен екран.
Sony комбинираха Playstation Network и Cloud технологията на Gaikai Inc, за да могат геймърите незабавно да започнат да играят част от заглавие, което ги интересува, а не просто демо!
Създай магически моменти, които ще запомниш за цял живот с PlayStation 4.
Технически характеристики:
Основен процесор: CPU: x86-64 AMD 'Jaguar' 8-ядрен процесор GPU: 1.84 TFLOPS, AMD базиран на Radeon™ графичен енджин от следващо поколение
Памет: GDDR5 8GB
Твърд диск: 1ТB, вграден
Оптично устройство: Blu-ray
Входно-изходни и мрежови интерфейси: Super-Speed USB (USB 3.0) AUX порт Ethernet (10BASE-T, 100BASE-TX, 1000BASE-T) Wi-Fi IEEE 802.11 b/g/n Bluetooth® 2.1 (EDR)
AV изход: HDMI Аналогов аудио/видео изход Цифров оптичен изход
Размери: приблизително 275 x 53 x 305 мм
Тегло: приблизителнo 2.8 кг
Пакетът включва: Конзола PlayStation 4 1TB, Контролер Dualshock 4, Играта Call of Duty: Black Ops III, Слушалка с микрофон (Monoheadset), Захранващ кабел, HDMI кабел, USB кабел.",
                ShortDecription = @"С този пакет получавате конзола PlayStation 4 1TB, контролер, слушалка с микрофон и играта Call of Duty: Black Ops III",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[3],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[0],
                Price = 799,
                Quantity = 5,
                Whidth = 50,
                Heigth = 40,
                Depht = 15,
                Weight = 5,
                ImagePath = "/Images/SeedImages/products/PS4/1.jpg"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/PS4/1.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/PS4/2.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/PS4/3.jpg" }
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "Playstation Vita",
                Description = @"PlayStation Vita с карта памет и колекция от 4 невероятни игри, за непрекъснато забавление!
Пакетът съдържа: конзола PlayStation Vita PCH-2016, Ваучер за изтегляне на 4 игри, 8GB карта памет
Ваучер за изтегляне на 4 игри от Sony PSN Store за твоята PS Vita конзола: Uncharted: Golden Abyss, Tearaway, LittleBigPlanet PS Vita, When Vikings Attack.
8GB карта памет: Използвай твоята PlayStation Vita 8GB карта памет, за да съхраняваш игри, сейвове и снимки.",
                ShortDecription = @"PlayStation Vita с карта памет и колекция от 4 невероятни игри, за непрекъснато забавление!",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[3],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[0],
                Price = 399,
                Quantity = 5,
                Whidth = 15,
                Heigth = 10,
                Depht = 5,
                Weight = 0.5,
                ImagePath = "/Images/SeedImages/products/VITA/1.jpg"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/VITA/1.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/VITA/2.jpg" },
                //    new Image { ImagePath = "/Images/SeedImages/products/VITA/3.jpg" },
                // }
            });
            this.Products.Add(new Product()
            {
                Name = "MacBook Pro",
                Description = @"13.3-инчов (по диагонал) дисплей с ултрависока резолюция 2560 на 1600 пиксела - поддържащ милиони цветове

Процесор: 2.9GHz Dual-Core Intel Core i5 процесор (Turbo Boost до 3.3Ghz)

Памет: 8GB 1866MHz DDR3L3 RAM

512GB Flash Storage (SSD (флаш) памет)

Графика: Intel HD Graphics 6100 графичен процесор

Светеща клавиатура international",
                ShortDecription = @"13.3-in Retina дисплей с ултрависока резолюция 2560 на 1600 пиксела 
2.7GHz Dual - Core Intel Core i5
8GB 1866MHz DDR3L3 RAM
128GB Flash Storage(SSD(флаш) памет)",

                // Category = this.categories[this.GetRandomNumber(0, this.categories.Count - 1)],
                Category = this.categories[2],
                CreatedOn = DateTime.Now.AddDays(rand.Next(-5, 5)),
                Manufacturer = this.Manufacturers[3],
                Price = 2859,
                Quantity = 5,
                Whidth = 15,
                Heigth = 10,
                Depht = 5,
                Weight = 0.5,
                ImagePath = "/Images/SeedImages/products/MacBook/1.png"

                // Images = new List<Image>()
                // {
                //    new Image { ImagePath = "/Images/SeedImages/products/MacBook/1.png" },
                //    new Image { ImagePath = "/Images/SeedImages/products/MacBook/2.png" },
                //    new Image { ImagePath = "/Images/SeedImages/products/MacBook/3.png" },
                // }
            });
        }

        public List<Product> Products { get; set; }

        public List<Promotion> Promotions { get; set; }

        public List<Country> Countries { get; set; }

        public List<City> Cities { get; set; }

        public List<Address> Addresss { get; set; }

        public List<Manufacturer> Manufacturers { get; set; }

        public User Admin { get; set; }

        private int GetRandomNumber(int min, int max)
        {
            return rand.Next(min, max + 1);
        }
    }
}
